app/controllers/breeds_controller.rb

  def index
    filter_value = nil

    if params[:filter] != nil
      filter_id = params[:filter_id]

      if filter_id == "TYPE"
        filter_value = params[:filter][:value]
      end
    end

    if filter_value != nil
      #params[:subtype] = filter_value
      conditions = [ "subtype = ?", filter_value]
    else
      conditions = []
    end

    params[:filter] = 'name' if params[:filter] == nil

    #@breeds = Breed.find(:all, :conditions => conditions)
    @breeds = Breed.paginate(:all, :conditions => conditions, :page => params[:page], :per_page => 30)
---
SELECT * FROM `breeds` LIMIT 0, 30
SELECT count(*) AS count_all FROM `breeds`