app/controllers/groomers_controller.rb

SELECT * FROM `groomers`
---
  def index
    @groomers = Groomer.find_by_current_user User.current_user(session), params

    if @groomers.empty?